app/controllers/admin/attribute_types_controller.rb

  def index
    @attribute_types = AttributeType.all
---
SELECT `attribute_types`.* FROM `attribute_types`