app/controllers/admin/document_types_controller.rb

SELECT `document_types`.* FROM `document_types`
---
  def index
    @document_types = DocumentType.all

INSERT INTO `document_types` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2011-12-18 21:54:02', '', 'Map', '2011-12-18 21:54:02')
---
  def create
    @document_type = DocumentType.new(params[:document_type])

    respond_to do |format|
      if @document_type.save