app/controllers/admin/event_types_controller.rb

  def index
    @event_types = EventType.all
---
SELECT `event_types`.* FROM `event_types`

  def create
    @event_type = EventType.new(params[:event_type])

    respond_to do |format|
      if @event_type.save
---
INSERT INTO `event_types` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2011-12-19 20:13:42', '', 'Photographed', '2011-12-19 20:13:42')