app/controllers/admin/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
     @orders=Order.all.paginate(:page =>params[:page], :order =>'id desc', :per_page =>20)