app/controllers/admin/statuses_controller.rb

  def index
    @statuses = Status.all
---
SELECT `statuses`.* FROM `statuses`

  def edit
    @status = Status.find(params[:id])
---
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1

  def update
    @status = Status.find(params[:id])

    respond_to do |format|
      if @status.update_attributes(params[:status])
---
SELECT `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 1 LIMIT 1
UPDATE `statuses` SET `name` = 'For sale', `updated_at` = '2011-12-16 07:44:30' WHERE `statuses`.`id` = 1