app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
  	@users=User.all.paginate(:page =>params[:page], :order =>'id desc', :per_page =>2)