app/views/documents/_person_event_fields.html.erb


    	<td><%= f.select :date_modifier, PersonEvent::DATE_MODIFIERS,:include_blank=>true,:title=>"ABT:About,AFT:after"%></td>
---
SELECT `person_events`.* FROM `person_events` WHERE `person_events`.`person_id` = 1