app/views/documents/index.html.erb

SELECT `documents`.* FROM `documents` WHERE `documents`.`user_id` = 2
---
          <td><%= link_to document.status.try(:name), document_path(document) %></td>
            <% if !current_user.blank? && (current_user.is_document_owner(document.user_id) || current_user.is_admin?) %>