app/views/documents/show.html.erb

SELECT `attribute_documents`.* FROM `attribute_documents` WHERE `attribute_documents`.`document_id` IN (1)
---
          <!-- Document Attributes -->
          <% @document.attribute_documents.each do |doc_attr| %>

SELECT `document_photos`.* FROM `document_photos` WHERE `document_photos`.`document_id` = 1
---
      <% end %>
      <% if !@document.blank? && !@document.document_photos.blank? %>

SELECT `people`.* FROM `people` WHERE `people`.`document_id` = 1
---

      <% if !@document.blank? && !@document.people.blank? %>

SELECT `locations`.* FROM `locations` WHERE `locations`.`document_id` = 1
---
	           </div>
	           <div class="floatLeft space contant odd" style="background-color:<%=person.sex_color%>"><%= person.birth_date rescue '' %> <%= "(#{person.birth_location})" unless person.birth_location.blank? %></div>

SELECT `person_events`.* FROM `person_events` WHERE `person_events`.`person_id` = 1
---
				 <%if !person.person_events_except_dob.nil?%>
				 	<%person.person_events_except_dob.each do |person_event|%>