app/controllers/documents_controller.rb

  def index
    @documents = current_user.documents.paginate(:page =>params[:page], :order =>'id desc', :per_page =>50)
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`user_id` = 2

  def show
    @document = Document.find(params[:id], :include => [:attribute_documents])
---
SELECT `attribute_documents`.* FROM `attribute_documents` WHERE `attribute_documents`.`document_id` IN (1)
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1

  def create
    @document = current_user.documents.new(params[:document])

    if @document.save
---
INSERT INTO `documents` (`binding`, `comment`, `condition`, `created_at`, `depth`, `document_type_id`, `edition`, `is_hidden`, `length`, `name`, `pages`, `purchase_date`, `purchase_price`, `purchase_vendor`, `sale_date`, `sale_price`, `sale_purchaser`, `status_id`, `stock_number`, `title`, `updated_at`, `user_id`, `weight`, `width`) VALUES ('Good', 'In testing', 'Good', '2011-12-15 06:19:54', 10, 1, 1, NULL, 50, 'The Test book for past and paper developement', 50, NULL, NULL, '', NULL, 50, '', 1, '201110', 'The Test book for past and paper developement', '2011-12-15 06:19:54', 2, 250, 25)

  def edit
    @document = current_user.documents.find(params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`user_id` = 2 AND `documents`.`id` = 1 LIMIT 1

  def update
  @document = current_user.documents.find(params[:id])
    @document.update_attributes(params[:document])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`user_id` = 2 AND `documents`.`id` = 1 LIMIT 1
UPDATE `documents` SET `purchase_date` = '2008-09-17', `purchase_price` = 31, `length` = 290, `width` = 245, `depth` = 90, `weight` = 2700, `condition` = 'Boards detached, Spine Detached, Binding Loose. Badly worn, with signs of damp & insect damage', `binding` = 'Leather', `comment` = 'Also includes a letter from Edith Clara Kellia dated August 2nd 1871, possibly to Georgina Kellham nee Williams, wife of James Kellham (b. abt. 1795) including further genealogy – see L00001. Also a small handwritten manuscript entitled “Old Lutheranism”signed JK', `updated_at` = '2011-12-22 19:10:32' WHERE `documents`.`id` = 83
UPDATE `users` SET `last_activity_at` = '2011-12-16 07:50:32', `updated_at` = '2011-12-16 07:50:32' WHERE `users`.`id` = 2

  def remove_image
  	@document_photo=DocumentPhoto.find(params[:id])
  	if !@document_photo.nil?
  		@document_photo.destroy
---
SELECT `document_photos`.* FROM `document_photos` WHERE `document_photos`.`id` = 136 LIMIT 1
DELETE FROM `document_photos` WHERE `document_photos`.`id` = 136